RedditClone/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_c(params[:user][:username], params[:user][:password])
        if @user && @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "sam"], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "Kkj2O0X7cgWwXxr4e8131Q"], ["id", 1]]