RedditClone/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_d", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "sam"], ["password_d", "$2a$12$cct6EPpNDVWW3FPPWBA0xOFp/NhAdDCl34hBjn8efm34cR5ry/1ki"], ["session_token", "adDZGA1APnKO-3TuSj4tIw"]]