RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "HP8OAZxd-Cj7VPra1hQHTQ"], ["id", 1]]
---
    def reset_session_token
        self.session_token = User.make_session_token
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "sadasd"], ["LIMIT", 1]]
---
    def self.find_by_c(username, password)